app/Controllers/Products.php

SELECT *
FROM `records`
---
    public function index() {
        $model = new ProductModel();
        $data['records'] = $model->findAll();