app/Controllers/Records.php

SELECT *
FROM `records`
---
    public function index() {
        $model = new RecordsModel();
        $data['records'] = $model->findAll();

SELECT *
FROM `records`
WHERE `records`.`id` = '2'
---
    public function edit($id) {
        $model = new RecordsModel();
        $data['record'] = $model->find($id);

DELETE FROM `records`
WHERE `id` IN ('7')
---
    public function delete($id) {
        $model = new RecordsModel();
        $model->delete($id);